# Шаг 1: Используем официальный образ Node.js как базовый
FROM node:20-alpine

# Шаг 2: Устанавливаем рабочую директорию
WORKDIR /app

# Шаг 3: Копируем package.json и package-lock.json в контейнер
COPY package*.json ./

# Шаг 4: Устанавливаем зависимости
RUN npm install

# Шаг 5: Копируем весь проект в контейнер
COPY . .

# Шаг 6: Собираем проект для продакшн-окружения
RUN npm run build

# Шаг 7: Указываем, что контейнер будет слушать порт 5173 (или другой порт, если используешь другой)
EXPOSE 4173

# Шаг 8: Команда для старта сервера
CMD ["npm", "run", "preview"]
